package exercises

object moviesort {
  def main(args: Array[String]): Unit = {

    var list1  = List(("美人鱼",73850),
      ("西游伏妖篇",91208),
      ("左耳",39773),
      ("西游降魔篇",79731),
      ("大圣归来",133290),
      ("釜山行",102793),
      ("小时代1",88614),
      ("何以笙箫默",26780),
      ("大鱼海棠",83609),
      ("泰囧",85520),
      ("疯狂动物城",137440),
      ("变形金刚4",58677),
      ("湄公河行动",35017),
      ("美国队长3",64382),
      ("栀子花开",30446),
      ("十二生肖",46114),
      ("寻龙诀",113657),
      ("爱乐之城",96203),
      ("七月与安生",68234),
      ("复仇者联盟2",54124),
      ("长城",83031),
      ("九层妖塔",44303),
      ("小时代3",41109),
      ("后会无期",120044),
      ("复仇者联盟",77858),
      ("你的名字",112909),
      ("夏洛特烦恼",109096),
      ("钢铁侠1",23468))

    var moviedata  = list1.map(data => {
      (data._1, data._2)
    })

    var sortResult: List[(String, Int)] = moviedata.sortWith({ (x, y) => x._2 > y._2 })
    var sortHead:List[(String,Int)]=sortResult.take(10)
    sortHead.foreach(println)

  }

}
